+++
title = "23 Birthday Problems"
categories = ["bday-problems"]
tags = ["matrix-calculus", "power-series", "probability", "mle", "least-squares", "regression"]
math = "true"
+++

#+begin_export html
<aside class="custom-toc">
<nav>
<p class="sidebar__heading">Table Of Contents</p>
#+end_export

#+toc: headlines 2

#+begin_export html
</nav></aside>
#+end_export

{{< collapse folded="false" >}}

*** a)

Let "SB" denote the phrase "share birthdays":
\[\begin{align*}
\mathcal{P}(\geq 2~\mathrm{SB}) &= \mathcal{P}(3~\mathrm{SB}) + \mathcal{P}(4~\mathrm{SB}) + \ldots + \mathcal{P}(N~\mathrm{SB})\\
&= 1 - \mathcal{P}(\text{nobody }\mathrm{SB})\\
\mathcal{P}(\text{nobody }\mathrm{SB}) &= \frac{365}{365}\times\frac{364}{365}\times\ldots\frac{365-n+1}{365}\\
&= \frac{365!}{365^n(365-n)!}
\end{align*}\]

However, there is no obvious closed form value of \(n\) which satisfies \(\frac{365!}{365^n(365-n)!} < \frac{1}{2}\).

We can massage the equivalent LHS expression \(\frac{365}{365}\times\frac{364}{365}\times\ldots\frac{365-n+1}{365}\) into
\[\prod_{k=0}^{n-1}\frac{365-k}{365}\]

which can then be expressed in code:

#+BEGIN_SRC jupyter-python :session 23bp
  import math

  def no_shared_birthday_prob(n):
    probability = 1.0
    for k in range(n):
      probability *= (365 - k) / 365
    return probability

  threshold = 1/2
  n = 1

  while no_shared_birthday_prob(n) >= threshold:
    n += 1

  print(f"thus the smallest n such that p(no_shared_birthday) <= 1/2 = {n}")

#+END_SRC

#+RESULTS:
: thus the smallest n such that p(no_shared_birthday) <= 1/2 = 23

*** c)
Computing \(\hat{y}\) at \(x = 0.5\):

Given data:
\[\{(x^{(i)}, y^{(i)})\} = \{(-1, 1), (0, 0), (1, 1)\}, \quad \tau = 1, \quad \vec{x} = [1, x].\]

1. *Weights:*
  \[\begin{align*}
    w^{(i)}&= \exp\left(-\frac{(x^{(i)} - 0.5)^2}{2(1)^2}\right)\\
    \text{such that }w^{(1)} &= \exp\left(-\frac{(-1 - 0.5)^2}{2}\right) = \exp(-1.125) \\
    w^{(2)} &= \exp\left(-\frac{(0 - 0.5)^2}{2}\right) = \exp(-0.125) \\
    w^{(3)} &= \exp\left(-\frac{(1 - 0.5)^2}{2}\right) = \exp(-0.125) \\
    \text{thus, }W &= \text{diag}([w^{(1)}, w^{(2)}, w^{(3)}])
  \end{align*}\]
2. *Matrices:*
  \[X = \begin{bmatrix}1 & -1 \\1 & 0 \\1 & 1\end{bmatrix}
  , \quad \vec{y} = \begin{bmatrix}1 \\0 \\1\end{bmatrix}.\]

3. *Weighted least squares solution:*
   \[\vec{w} = \left(X^T W X\right)^{-1} X^T W \vec{y} = \begin{bmatrix}0.518\\0.223\end{bmatrix} \]

4. *Predicted value:*

  \[\hat{y} = \vec{x} \cdot \vec{w} \approx 0.63{\scriptsize\square}\]


#+BEGIN_SRC jupyter-python :session 23bp

  import numpy as np
  from numpy.linalg import inv
  X = np.array([[1,-1],[1,0],[1,1]])
  y = np.array([1,0,1])
  W = np.diag(np.array([np.exp(-1.125),np.exp(-0.125),np.exp(-0.125)]))
  w = inv(X.T @ W @ X)@X.T@W@y
  print(w)
  x_i = np.array([1,0.5])
  y_i = w @ x_i
  print(y_i)
#+END_SRC

#+RESULTS:
: [0.51825006 0.22262491]
: 0.6295625143296497

